'use strict';
const listRaces = [
  [1001, '男人'],
  [2001, '女人'],
  [1002, '男魔'],
  [2002, '女魔'],
  [1003, '男仙'],
  [2003, '女仙'],
  [1004, '男鬼'],
  [2004, '女鬼']
];
const listRoles = [
  [1,"逍遥生",1001],
  [2,"剑侠客",1001],
  [3,"猛壮士",1001],
  [4,"俏千金",2001],
  [5,"飞燕女",2001],
  [6,"英女侠",2001],
  [7,"巨魔王",1002],
  [9,"虎头怪",1002],
  [8,"夺命妖",1002],
  [10,"狐美人",2002],
  [11,"骨精灵",2002],
  [12,"小蛮妖",2002],
  [13,"神天兵",1003],
  [14,"龙战将",1003],
  [15,"智圣仙",1003],
  [16,"舞天姬",2003],
  [17,"精灵仙",2003],
  [18,"玄剑娥",2003],
  [40,"飞剑侠",1001],
  [41,"燕山雪",2001],
  [42,"逆天魔",1002],
  [43,"媚灵狐",2002],
  [44,"武尊神",1003],
  [45,"玄天姬",2003],
  [50,"纯阳子",1001],
  [51,"红拂女",2001],
  [52,"混天魔",1002],
  [53,"九尾狐",2002],
  [54,"紫薇神",1003],
  [55,"霓裳仙",2003],
  [60,"猎魂引",1004],
  [61,"无涯子",1004],
  [62,"祭剑魂",1004],
  [63,"夜溪灵",2004],
  [64,"幽梦影",2004],
  [65,"墨衣行",2004],
  [72, "神秀生", 1],
  [73, "玲珑女", 2],
  [74, "绝影魔", 1],
  [75, "霜月灵", 2],
  [76, "青阳使", 1],
  [77, "云中君", 2],
  [78, "南冠客", 1],
  [79, "镜花影", 2]
];

const mapRaces = {};
listRaces.forEach(list => {
  mapRaces[list[1]] = list[0];
});

// console.log(mapRaces);

const xlsxReader = require('../index');
const filename = 'role_types';
xlsxReader.read({
  input: `./${filename}.xlsx`,
  output: `./${filename}.json`,
  sheet: '所有角色'
}).then(result => {
  // [ { '角色': '逍遥生', '种族': '人', '性别': '男' } ] -> { 逍遥生: mapRaces[男人] }
  let map = {};
  result.forEach(item => {
    map[item['角色']] = mapRaces[item['性别'] + item['种族']];
  });

  // listRoles = [ [1, "逍遥生"] ] -> [ [1, "逍遥生", 1001] ]
  listRoles.forEach(list => {
    list[2] = map[list[1]];
  });

  xlsxReader.save(`./${filename}_data.json`, listRoles);
  console.log('生成完毕');
});
