var SchoolNameInfo = { 1 : "大唐官府", 2 : "化生寺", 3 : "女儿村", 4 : "方寸山", 5 : "天宫", 6 : "普陀山", 7 : "龙宫", 8 : "五庄观", 9 : "狮驼岭", 10 : "魔王寨", 11 : "阴曹地府", 12 : "盘丝洞", 13: "神木林", 14: "凌波城", 15: "无底洞"};

var RoleKindNameInfo = {1:"逍遥生",2:"剑侠客",3:"飞燕女",4:"英女侠",5:"巨魔王",6:"虎头怪",7:"狐美人",8:"骨精灵",9:"神天兵",10:"龙太子",11:"舞天姬",12:"玄彩娥", 203: "巫蛮儿", 205: "杀破狼", 209: "羽灵神"};

var SchoolKindMapping = {
	1 : [1,2,3,4,203],
	2 : [1,2],
	3 : [3,4,203],
	4 : [1,2,3,4,203],
	5 : [11,12,9,10,209],
	6 : [11,12],
	7 : [11,12,9,10,209],
	8 : [9,10,209],
	9 : [5,6,205],
	10: [7,8,5,6,205],
	11: [7,8,5,6,205],
	12: [7,8],
	13: [1,2,3,4,203],
	14: [9,10,11,12,209],
	15: [5,6,7,8,205]
};

function get_school_name(school_id)
{
	return SchoolNameInfo[school_id];
}

function get_role_kind_name(icon){
	var kindid = icon;
	if (icon > 200) {
		kindid =  ((icon -200 - 1)%12 + 1) + 200;
	} else {
		kindid = ((icon - 1)%12 + 1);
	}
	return RoleKindNameInfo[kindid];
}


var PetEquipKindInfo  = {1:"铠甲", 2:"项圈", 3:"护腕"};

var PRIMARY_YAO_JUE =
["反击","反震","吸血","连击","飞行","夜战","隐身","感知","再生","冥思","慧根","必杀","幸运","神迹","招架","永恒","敏捷","强力","防御","偷袭","毒","驱鬼","鬼魂术","魔之心","神佑复生","精神集中","否定信仰","雷击","落岩","水攻","烈火","法术连击","法术暴击","法术波动","雷属性吸收","土属性吸收","火属性吸收","水属性吸收","迟钝"];
var SENIOR_YAO_JUE = ["高级反击","高级反震","高级吸血","高级连击","高级飞行","高级夜战","高级隐身","高级感知","高级再生","高级冥思","高级慧根","高级必杀","高级幸运","高级神迹","高级招架","高级永恒","高级敏捷","高级强力","高级防御","高级偷袭","高级毒","高级驱鬼","高级鬼魂术","高级魔之心","高级神佑复生","高级精神集中","高级否定信仰","奔雷咒","泰山压顶","水漫金山","地狱烈火","高级雷属性吸收","高级土属性吸收","高级火属性吸收","高级水属性吸收","高级法术连击","高级法术暴击","高级法术波动","壁垒击破","嗜血追击"];
var MO_SHOU_YAO_JUE = PRIMARY_YAO_JUE.concat(SENIOR_YAO_JUE);


function is_advanced_yaojue(name){
	for(var i = 0; i < SENIOR_YAO_JUE.length; i++)
		if(name.indexOf(SENIOR_YAO_JUE[i]) != -1)
			return true;
	return false;
}

var EquipKind = {"pet":1,"stone":2,"msyj":3, "other":4};

var PET_WUXING_INFO = {
	"1":"金",
	"2":"木",
	"4":"土",
	"8":"水",
	"16":"火" };

//内丹
var PetNeidanInfo = {
	901: "迅敏",
	902: "狂怒",
	903: "阴伤",
	904: "静岳",
	905: "擅咒",
	906: "灵身",
	907: "矫健",
	908: "深思",
	909: "钢化",
	910: "坚甲",
	912: "慧心",
	913: "撞击",
	914: "神机步",
	915: "腾挪劲",
	916: "玄武躯",
	917: "龙胄铠",
	918: "玉砥柱",
	919: "碎甲刃",
	920: "阴阳护",
	921: "凛冽气",
	922: "无畏",
	923: "愤恨",
	924: "舍身击",
	925: "电魂闪",
	926: "通灵法",
	927: "双星爆",
	928: "催心浪",
	929: "淬毒",
	930: "隐匿击",
	931: "狙刺",
	932: "连环",
	933: "圣洁",
	934: "血债偿",
	935: "生死决",
	936: "灵光",
	937: "朱雀甲"
};

var PetSkillInfo = {302:"反击", 303:"反震", 304:"吸血", 305:"连击", 306:"飞行", 301:"夜战", 307:"隐身", 308:"感知", 309:"再生", 310:"冥思", 315:"慧根", 316:"必杀", 317:"幸运", 319:"神迹", 320:"招架", 321:"永恒", 322:"敏捷", 334:"强力", 335:"防御", 325:"偷袭", 314:"毒", 313:"驱鬼", 312:"鬼魂术", 324:"魔之心", 311:"神佑复生", 318:"精神集中", 323:"否定信仰", 326:"雷击", 327:"落岩", 328:"水攻", 329:"烈火", 510:"法术连击", 575:"法术暴击", 576:"法术波动", 330:"雷属性吸收", 331:"土属性吸收", 333:"火属性吸收", 332:"水属性吸收", 501:"弱点雷", 502:"弱点土", 503:"弱点水", 504:"弱点火", 505:"迟钝", 402:"高级反击", 403:"高级反震", 404:"高级吸血", 405:"高级连击", 406:"高级飞行", 401:"高级夜战", 407:"高级隐身", 408:"高级感知", 409:"高级再生", 410:"高级冥思", 415:"高级慧根", 416:"高级必杀", 417:"高级幸运", 419:"高级神迹", 420:"高级招架", 421:"高级永恒", 422:"高级敏捷", 434:"高级强力", 435:"高级防御", 425:"高级偷袭", 414:"高级毒", 413:"高级驱鬼", 412:"高级鬼魂术", 424:"高级魔之心", 411:"高级神佑复生", 418:"高级精神集中", 423:"高级否定信仰", 426:"奔雷咒", 427:"泰山压顶", 428:"水漫金山", 429:"地狱烈火", 430:"高级雷属性吸收", 431:"高级土属性吸收", 433:"高级火属性吸收", 432:"高级水属性吸收", 551:"惊心一剑", 552:"死亡召唤", 554:"善恶有报", 553:"上古灵符", 573:"高级法术连击", 577:"高级法术暴击", 578:"高级法术波动", 571:"力劈华山", 572:"夜舞倾城", 579:"法术防御", 595:"壁垒击破", 596:"嗜血追击", 597:"剑荡四方", 599:"移花接木", 593:"八凶法阵", 624: "龙魂", 626: "法术抵抗", 628: "盾气", 627: "高级法术抵抗", 629: "高级盾气",660:"浮云神马", 661:"须弥真言", 662:"千钧一怒"};
var PetFunctions = {1:"攻宠", 2:"法宠", 3:"血宠", 4:"血敏宠", 5:"炼妖宠"};

var EmptySkillImg = ResUrl + "/images/role_skills/empty_skill.gif";

var SaleNeidanSkills = [
	'神机步',
	'腾挪劲',
	'玄武躯',
	'龙胄铠',
	'玉砥柱',
	'碎甲刃',
	'阴阳护',
	'凛冽气',
	'舍身击',
	'电魂闪',
	'通灵法',
	'双星爆',
	'催心浪',
	'隐匿击',
	'生死决',
	'血债偿'
];
